--  Опис
--  База даних Академія (Academy) містить інформацію про
-- співробітників та внутрішній порядок академії.
--  Викладачі, які читають лекції в академії, занесені до таблиці
-- Викладачі (Teachers), в якій зібрано основну інформацію: ім’я,
-- прізвище, дані про зарплату, дата приймання на роботу.
--  Також у базі даних є інформація про групи, яка зберігається в таблиці Групи (Groups).
--  Дані про факультети та кафедри містяться в таблицях Факультети (Faculties) та Кафедри
-- (Departments) відповідно.
--  створення бази даних
    CREATE DATABASE Academy;

--  Таблиці
--  Нижче наведено опис структури кожної таблиці.

--  --  TABLE Кафедри (Departments)
--  ■ Ідентифікатор (Id). Унікальний ідентифікатор кафедри.
--  ▷ Тип даних — int.
--  ▷ Автоприріст.
--  ▷ Не містить null-значення.
--  ▷ Первинний ключ.
--  ■ Фінансування (Financing). Фонд фінансування кафедри.
--  ▷ Тип даних — DECIMAL 12,2.
--  ▷ Не містить null-значення.
--  ▷ Не може бути менше, ніж 0.
--  ▷ Значення за замовчуванням — 0.
--  ■ Назва (Name). Назва кафедри.
--  ▷ Тип даних — varchar(100).
--  ▷ Не містить null-значення.
--  ▷ Не може бути порожньою.
--  ▷ Має бути унікальною.
CREATE TABLE Departments (
    Id INT PRIMARY KEY,
    Financing DECIMAL(12,2) NOT NULL DEFAULT 0,
    Name VARCHAR(100) NOT NULL UNIQUE

);
--  --  TABLE Факультети (Faculties)
--  ■ Ідентифікатор (Id). Унікальний ідентифікатор факультету.
--  ▷ Тип даних — int.
--  ▷ Автоприріст.
--  ▷ Не містить null-значення.
--  ▷ Первинний ключ.
--  ■ Декан (Dean). Декан факультету.
--  ▷ Тип даних — varchar(255).
--  ▷ Не містить null-значення.
--  ▷ Не може бути порожнім.
--  ■ Назва (Name). Назва факультету.
--  ▷ Тип даних — varchar(100).
--  ▷ Не містить null-значення.
--  ▷ Не може бути порожньою.
--  ▷ Має бути унікальною.
    CREATE TABLE Faculties (
    Id INT PRIMARY KEY,
    Dean VARCHAR(255) NOT NULL,
    Name VARCHAR(100) NOT NULL UNIQUE

);
--  --  TABLE Групи (Groups)
--  ■ Ідентифікатор (Id). Унікальний ідентифікатор групи.
--  ▷ Тип даних — int.
--  ▷ Автоприріст.
--  ▷ Не містить null-значення.
--  ▷ Первинний ключ.
--  ■ Назва (Name). Назва групи.
--  ▷ Тип даних — varchar(10).
--  ▷ Не містить null-значення.
--  ▷ Не може бути порожньою.
--  ▷ Має бути унікальною.
--  ■ Рейтинг (Rating). Рейтинг групи.
--  ▷ Тип даних — int.
--  ▷ Не містить null-значення.
--  ▷ Має бути в діапазоні від 0 до 5.
--  ■ Курс (Year). Курс (рік), на якому навчається група.
--  ▷ Тип даних — int.
--  ▷ Не містить null-значення.
--  ▷ Має бути в діапазоні від 1 до 5.
CREATE TABLE Groups (
    Id INT PRIMARY KEY,
    Name VARCHAR(10) NOT NULL UNIQUE,
    Rating INT NOT NULL CHECK (Rating BETWEEN 0 AND 5),
    Year INT NOT NULL CHECK (Year BETWEEN 1 AND 5),
    FOREIGN KEY (Id) REFERENCES Departments(Id)
);
--  TABLE Викладачі (Teachers)
--  ■ Ідентифікатор (Id). Унікальний ідентифікатор
--  викладача.
--  ▷ Тип даних — int.
--  ▷ Автоприріст.
--  ▷ Не містить null-значення.
--  ▷ Первинний ключ.
--  ■ Дата працевлаштування (EmploymentDate). Дата працевлаштування викладача.
--  ▷ Тип даних — date.
--  ▷ Не містить null-значення.
--  ▷ Не може бути менше 01.01.1990.
--  ■ Асистент (IsAssistant). Чи є викладач асистентом.
--  ▷ Тип даних — bit.
--  ▷ Не містить null-значення.
--  ▷ Значення за замовчуванням — 0.
--  ■ Професор (IsProfessor). Чи є викладач професором.
--  ▷ Тип даних — bit.
--  ▷ Не містить null-значення.
--  ▷ Значення за замовчуванням — 0.
--  ■ Ім’я (Name). Ім’я викладача.
--  ▷ Тип даних — nvarchar(max).
--  ▷ Не містить null-значення.
--  ▷ Не може бути порожнє.
--  ■ Посада (Position). Посада викладача.
--  ▷ Тип даних — varchar(max).
--  ▷ Не містить null-значення.
--  ▷ Не може бути порожньою.
--  ■ Надбавка (Premium). Надбавка викладача.
--  ▷ Тип даних — DECIMAL 12,2.
--  ▷ Не містить null-значення.
--  ▷ Не може бути менше, ніж 0.
--  ▷ Значення за замовчуванням — 0.
--  ■ Ставка (Salary). Ставка викладача.
--  ▷ Тип даних — DECIMAL 12,2.
--  ▷ Не містить null-значення.
--  ▷ Не може бути меншою або дорівнювати 0.
--  ■ Прізвище (Surname). Прізвище викладача.
--  ▷ Тип даних — nvarchar(200).
--  ▷ Не містить null-значення.
--  ▷ Не може бути порожнє
CREATE TABLE Teachers (
    Id INT PRIMARY KEY,
    EmploymentDate DATE NOT NULL CHECK (EmploymentDate >= '01.01.1990'),
    IsAssistant BIT NOT NULL DEFAULT 0,
    IsProfessor BIT NOT NULL DEFAULT 0,
    Name VARCHAR(100) NOT NULL,
    Position VARCHAR(100) NOT NULL,
    Premium DECIMAL(12,2) NOT NULL DEFAULT 0,
    Salary DECIMAL(12,2) NOT NULL CHECK (Salary > 0),
    Surname VARCHAR(200) NOT NULL
);

